In [1]:
import pandas as pd

In [2]:
import requests
import io

url = "https://raw.githubusercontent.com/codebasics/py/master/ML/6_train_test_split/carprices.csv"
download = requests.get(url).content

df = pd.read_csv(io.StringIO(download.decode('utf-8')))

In [3]:
df

    Mileage  Age(yrs)  Sell Price($)
0     69000         6          18000
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
5     59000         5          26750
6     52000         5          32000
7     72000         6          19300
8     91000         8          12000
9     67000         6          22000
10    83000         7          18700
11    79000         7          19500
12    59000         5          26000
13    58780         4          27500
14    82450         7          19400
15    25400         3          35000
16    28000         2          35500
17    69000         5          19700
18    87600         8          12800
19    52000         5          28200

In [10]:
X = df.drop(['Sell Price($)'] , axis = 'columns')

In [11]:
X

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5
13    58780         4
14    82450         7
15    25400         3
16    28000         2
17    69000         5
18    87600         8
19    52000         5

In [15]:
y = df['Sell Price($)']

In [16]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     26750
6     32000
7     19300
8     12000
9     22000
10    18700
11    19500
12    26000
13    27500
14    19400
15    35000
16    35500
17    19700
18    12800
19    28200
Name: Sell Price($), dtype: int64

Now we are going to split this data set for training and test purposes

In [4]:
from sklearn.model_selection import train_test_split

there are four parameters x_train , x_test , y_train , y_test .

In [39]:
x_train , x_test , y_train , y_test = train_test_split(X,y,test_size=0.35)

it will randomly choose 80 percent of training data , you have to pass the argument of size

In [40]:
x_train

    Mileage  Age(yrs)
18    87600         8
14    82450         7
16    28000         2
9     67000         6
5     59000         5
2     57000         5
3     22500         2
17    69000         5
19    52000         5
0     69000         6
7     72000         6
4     46000         4
13    58780         4

if you want to not select randomly after running it use random_state=10 as an argument

In [41]:
x_test

    Mileage  Age(yrs)
15    25400         3
8     91000         8
1     35000         3
11    79000         7
10    83000         7
12    59000         5
6     52000         5

# let's do the prediction

In [42]:
from sklearn.linear_model import LinearRegression
clf = LinearRegression()

In [43]:
clf.fit(x_train,y_train)

LinearRegression()

In [44]:
clf.predict(x_test)

array([38018.08631368, 12672.70636446, 34557.67014479, 17338.0671346 ,
       15896.22706423, 25226.94860451, 27750.16872766])

In [45]:
y_test #checking how much accuracy it have met.

15    35000
8     12000
1     34000
11    19500
10    18700
12    26000
6     32000
Name: Sell Price($), dtype: int64

In [46]:
clf.score(x_test,y_test) #compare the prediction with the real values

0.9124853051586462